# Importing pandas and CSV file

In [1]:
import pandas as pd

In [17]:
df = pd.read_csv('task-2.csv')

In [18]:
df.head()

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester
0,4001,Ali Khan,Mathematics,8.0,7.0,18.0,25,45.0,90,1
1,4002,Sara Ahmed,Physics,7.0,NaN,15.0,20,40.0,85,1
2,4003,Omar Malik,Chemistry,9.0,8.0,NaN,28,48.0,95,1
3,4004,Ayesha Khan,Mathematics,6.0,5.0,14.0,22,NaN,80,1
4,4005,Usman Iqbal,Physics,11.0,7.0,18.0,26,49.0,105,1

In [19]:
df

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester
0,4001,Ali Khan,Mathematics,8.0,7.0,18.0,25,45.0,90,1
1,4002,Sara Ahmed,Physics,7.0,NaN,15.0,20,40.0,85,1
2,4003,Omar Malik,Chemistry,9.0,8.0,NaN,28,48.0,95,1
3,4004,Ayesha Khan,Mathematics,6.0,5.0,14.0,22,NaN,80,1
4,4005,Usman Iqbal,Physics,11.0,7.0,18.0,26,49.0,105,1
5,4006,Hina Raza,Chemistry,8.0,8.0,17.0,27,-10.0,92,1
6,4007,Zain Ali,Mathematics,7.0,7.0,16.0,23,44.0,88,1
7,4008,Nadia Khan,Physics,NaN,6.0,15.0,21,39.0,82,1
8,4009,Fahad Iqbal,Chemistry,8.0,7.0,16.0,25,47.0,90,1
9,4010,Maryam Ali,Mathematics,7.0,6.0,14.0,22,42.0,80,1
10,4011,Ali Khan,Mathematics,8.0,7.0,18.0,25,45.0,90,1
11,4012,Hassan Raza,Physics,6.0,5.0,13.0,20,38.0,75,1
12,4013,Fatima Malik,Chemistry,9.0,8.0,19.0,30,50.0,98,1
13,4014,Omar Khan,Mathematics,5.0,6.0,12.0,18,35.0,70,1
14,4015,Sara Ahmed,Physics,7.0,7.0,15.0,21,40.0,85,1

# Cleaning
- No negative markings
- Out-of-range scores
- No duplicates
- Change datatype as needed
- No missing values

In [20]:
# checking null values
df.isna().sum()

student_id    0
name          0
course        0
quiz1         1
quiz2         1
assignment    1
midterm       0
final         1
attendance    0
semester      0
dtype: int64

In [21]:
# seeing the place of missing values
df[df['quiz1'].isna()]
df[df['quiz2'].isna()]
df[df['assignment'].isna()]
df[df['final'].isna()]

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester
3,4004,Ayesha Khan,Mathematics,6.0,5.0,14.0,22,NaN,80,1

In [26]:
# filling the missing values (with mean of column)
df['quiz1'] = df['quiz1'].fillna(df['quiz1'].mean())
df['quiz2'] = df['quiz2'].fillna(df['quiz2'].mean())
df['assignment'] = df['assignment'].fillna(df['assignment'].mean())
df['final'] = df['final'].fillna(df['final'].mean())

In [29]:
#verified
df.isna().sum()

student_id    0
name          0
course        0
quiz1         0
quiz2         0
assignment    0
midterm       0
final         0
attendance    0
semester      0
dtype: int64

In [35]:
# checking for negative value
df['final'] < 0

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
Name: final, dtype: bool

In [40]:
# replacing negative value with mean
df.loc[5,'final'] = df['final'].mean()

In [42]:
# checking for duplicates
df.duplicated().sum()

np.int64(0)

In [60]:
df.dtypes

student_id      int64
name           object
course         object
quiz1         float64
quiz2         float64
assignment    float64
midterm         int64
final         float64
attendance      int64
semester        int64
dtype: object

### Out-of-range values checking

In [62]:
df[(df['quiz1'] > 10) | (df['quiz1'] < 0)]

,student_id,name,course,quiz1,quiz2,assignment,midterm,final,attendance,semester
4,4005,Usman Iqbal,Physics,11.0,7.0,18.0,26,49.0,105,1

In [63]:
df[(df['quiz2'] > 10) | (df['quiz2'] < 0)]

Empty DataFrame
Columns: [student_id, name, course, quiz1, quiz2, assignment, midterm, final, attendance, semester]
Index: []

In [64]:
df[(df['assignment'] > 20) | (df['assignment'] < 0)]

Empty DataFrame
Columns: [student_id, name, course, quiz1, quiz2, assignment, midterm, final, attendance, semester]
Index: []

In [65]:
df[(df['midterm'] > 30) | (df['midterm'] < 0)]

Empty DataFrame
Columns: [student_id, name, course, quiz1, quiz2, assignment, midterm, final, attendance, semester]
Index: []

In [66]:
df[(df['final'] > 50) | (df['final'] < 0)]

Empty DataFrame
Columns: [student_id, name, course, quiz1, quiz2, assignment, midterm, final, attendance, semester]
Index: []

In [67]:
# assigning max limit marks to outbound value i.e 11 to 10
df.loc[4,'quiz1'] = 10